tests/xma/4.1/xma_ProvAPI/ProvisioningCore-API/existingdevice.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://provisioning.intf.mobilgw.com/">
  <soap:Body>
    <tns:getDeviceByUserAgent>
      <arg0>Nokia3650/1.0 SymbianOS/6.3</arg0>
    </tns:getDeviceByUserAgent>
  </soap:Body>
</soap:Envelope>